/*
 * random.h
 *
 *  Created on: 07.03.2013
 *      Author: Afinogen
 */

#ifndef RANDOM_H_
#define RANDOM_H_

#include <math.h>
#include <time.h>
#include <stdlib.h>



//---------------------------------------------------------------------------
// Генерация случайной величины, равномерно распреденной в интервале [0, 1]
double GetRand();
//---------------------------------------------------------------------------
// Генерация случайной величины, равномерно распределенной в интервале [a, b]
double GetRand(int a, int b);
//---------------------------------------------------------------------------
// Вычисление обратной функции стандатного нормального распределения
// p - доверитеьный уровень
double InverseNormalDistribution(double p);
//---------------------------------------------------------------------------
// Генерация случайной величины, нормально распределенной с параметрами [0, 1]
double GetNormalDistribution();
//---------------------------------------------------------------------------
// Генерация случайной величины, нормально распределенной с параметрами [m, s*s]
// m - математическое ожидание
// s - среднеквадратическое оклонение
double GetNormalDistribution(double m, double s);

#endif /* RANDOM_H_ */
